#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "49978908e7c4364e580dd37af83d5181" -> "73c78168bbd9ef6a7dbc70a462ed1532"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "054a88b0d263dd02626a8676a8039abd" -> "ba5727a0d6fc21a8ad7c695379109df6"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "6bfb6bf716cf80c3dd61f104231049ee" -> "c56d2e3106c282ec64728aa287965f9d"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d625b5c257d75e28e9ab69d87fcc0f07" -> "7cd69ed772c64a639753dec1edbdbba5"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "28158ecad87bcdf2071c69aa2c8e9f13" -> "6fa100d3a281e4e49fa6f477a28a5c61"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "b173331fc19bd14e36481bd110ec1222" -> "2ff483541d47ff443f8cd0dc28c845f4"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "1a0ecdf7b71337268ee6bd352d0965f0" -> "8b4736fe9b84952d8f1e271e85eec7ab"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "064daf03a7d617eeb98078d5f3a219df" -> "79f09f40882bb4532beeb4390bc61d57"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "082886d91dd2164163d0206b5b9cc20b" -> "9f91e058a9a6f6fbd8bca311d4072c68"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "aa9a3c3245207c14cb5be666ce9950d3" -> "a125f851134ce6166c53a395e40d7a95"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "e11423f755b5190a8c875539ff3f9208" -> "5349141bfefa6c40875d7f502806ca33"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "de6d287628c8381d43ceba60d2b1ea02" -> "0342918ec3f6d81b6bbc5c1933b5c096"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "67110c33d998a8d32578d4e44e8273cc" -> "ea8e1bc3032b6d0f5886851f037b86db"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "740b600363ed80c46301fea92149fde0" -> "0a6932e460d1aa298f3f6c80934c6641"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "1e1aff9e42d64bf37484a2835a4a28cf" -> "1498f104bb84627307e4da6917a84dbb"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "77762a290f44ecf7a9bff749a0197356" -> "4e011dc7c0237c694e263fa802c0aa1e"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e0d2350b480c9f2e49d013e3ee4f3483" -> "499f398b20e1a292aed2240679469cf6"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "5e289b854b8ae4c9bc88e07d8efd895c" -> "da45f9dbcf72425e8ea1b9eb15628e5f"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "acd22d8b10dc2629cff3ac0b145f85a6" -> "8eca029e30961cc7e220bc22ab23a828"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "5044f2ddf99a1f58f60b7b2e5044b07f" -> "fb920c0b5923e6edb38f706b0a92c6b0"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "f399f3ec7c9f86082f221cfc51d78f02" -> "b2aef5fce4c8dd541b42270b45878b17"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "53fb5af303c7555d37af81baa1e77719" -> "460a25ce5833b709a8849aa31b45d499"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "dd0301ac1f7be65e2a22ccaabe2769fc" -> "b585edda04fde1221c609bf3d65e6733"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "effac2b751a22bd2d98af05073197cc1" -> "9769fc739930f1651c438cb768007dd9"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "8ea237401d3e201996cd2934acf6689b" -> "31c5e9e6a437767bbb7481493ebda4ad"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "3b76466691b2bebd8c4347d74f39a74e" -> "16357c93ca6c2f14550095633ab39342"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "f2c91ab053701a15b21056cb5def442c" -> "9e6bef683b618abf584e935efdd5540a"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "b2ef4a8b899c4df6066fa4e10c4fe49f" -> "d0c889aa6bf3b2ac4c551c9a1e761d7e"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "7658352201ffbf6afbfc6f44f0a3e83d" -> "9824bdc052dc0ec345953eeb32a4269c"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "4f1e11549163dfc49ae8d403032f3458" -> "8e3a4d120cc988002c5a76f8a8a569a2"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e2fb7229cc789166e5832dfca4473915" -> "40c9f89b7d08c682046045350cee5ef5"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ea57270fefbc31f295de9c5f2f19478d" -> "1b9659a7b3fb1cd45290439d0d35f60e"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "e6a546f3a64cf1b8a5663eb5423ac6ce" -> "8f07ab575c041959ef08268bb8b68964"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "626de23d4632ab80b007e6dcb9bc10ab" -> "9835b2d83738969d40adb52003893d6f"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7f77ca41d8b24a5932853e5aa1d45c3d" -> "31da3205a69938c0a1279f6a0b036a92"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "972a6a938dd7cbe4bf5e1b3f541c6bb9" -> "24c0e63874ab9d1d9848db309514c172"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "cad73ba83e9a69389886f66c585d5aea" -> "569828063608f4114152ce50958d8e96"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "fb3b34e72d12a643733f33ae12f3444c" -> "2e7842b2172e7bf1d6edb1e534456942"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "63adc3dfcbbb8d80e3c5ca9cced34179" -> "430f54bf53498c896fbeeeaf05e58a38"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "cc83de0fa4bebf831cf4a4ae467282d4" -> "054f53885b27b56f74330b22ace5f8bb"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "2d630ef4063fa3d73a18502e29850cd5" -> "d5e1c8e332a5ddfd5b1793abb0e50a7d"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "cab697472f30fc827ca1996e3a415880" -> "ec2b0e324692f8e11dfa00fdcbf960c7"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "ee892eca0a622d9c865a63bd204ab307" -> "bd1f1ff1708c88c7a21ec0d875bbbcb6"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "84902a6e09f5f1d9cf9d1dc517e8a157" -> "e00404ff387b5d7e10ad2d08f9b0e1a5"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "3616fb2b9669bcf3fbf461f08e48ec1f" -> "202d7d1743643d707d4b0565590dc630"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "528f10818b49539a944476d01e4c54d0" -> "8ed5c65222ca7379b21510fee7cdeff5"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "e2b3511b39a74c5c70ae19a1fda0ac34" -> "6b4429855c2a1009974c7d857523cdfb"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "I7vo+jTRb6BCbKMUiyTK+DuFs9zxgWfGrbad79hzuRE=" -> "N6cB3W779Ug3NxvBOU/9QdcNocwu0V7aAGZseR1fttA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "AbjR8/5hiWNs6PVWzYVJhbNZYf2rshrMOHm/RY+jiko=" -> "XFAk4XwUQ+qbEiu+NfzcqH4KESLnrDi9pvp/7wKyHdk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "ogbTPZS4lEQ+7wTuvf+Uvhl8Ol78+ntCbYWRXHWA7h8=" -> "GPKfvEBEXn69iVEfef+/7Bio99RnhWBAYNZYQgNsd+0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "yFf89J3AhTHCmlvZHnUj2Q8NSBr5aWUlLyoR6PkazuU=" -> "KMyogoI4Va3g0YZXKKznaV9NAPc22o/gxXJuvQ+0XF0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "3hrVyF67Vd8LktP9WXlhjATkdEPKfgRRoxBnj9MxRKk=" -> "U8K4lgiuTsRMg+L6OM6uOOGbfCAoFTGVWPynP1z/5E4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "RDOQjHXM0AaOTBGPKwBlxgtG7SetR3P8LAmWx2D4sLA=" -> "MhSa7FA4fRcLKfI+pdvA5YV1m5Tfd7G7b2XVLLGb+BE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "F+Qb0efzVtk32umzT+X5IfcoayqGDhxxYCFL9eqYC0s=" -> "P2F5zqJ0d87JxDBz1BdOrz1Ah6NR5z88OkejhAjAr5w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "KNMQfz0DRyjNfvO2NKsXVDfYguqnawjNK8OQB+ZH9kQ=" -> "PR9Lrp28wBGZSZ4ClOCKEyz67oP43uSTEUDmywtozTY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "uebFC8Y4/K7eFFUd/zW48S2U6hYnKTVBQY6e4YtVr1M=" -> "/mfulKljhaeCCcu3rv2wpaxMpM6uwHIr/SfaMMoaPiY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "oijQS2GWzk/Jqz9WUnfAYLAqC8H77t3TiWrvxDKXysI=" -> "3Fed4mh23Z5wnVlnMXIyQEeNRfJcGbFzSQr6RJcYEoc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "zWINWU1K8P9ZcfdZ9L4kAWAGs+mkvSAPXTKx/9vwuoY=" -> "4rfz7CXrrtAkhVbSlcsRYxIWnMW5gxQUsZbje5Kicbo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "r9embf8SeSPTLEGxbxfv9FZ2Wnxbf4T9xy3GxMpPjFs=" -> "z1/LcWkqz9xKnOpWOChxlMgtsstSpV209TgDW9ohwLU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "0h7UqGBMOAn40vZRwrVWYvFdcilGWPaBh4+ZmX08Pls=" -> "nSHvhrX8OuZlDdV+RHpoaQyIBQ4kCG3AdlwF1s5u43s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "usxalsFxE2EJa6ZGxLXdbifnFuYDd+fBTNzxRU5EVpE=" -> "LPkXMzvo8+D0OlWQ3PLaWp4/9xrM/NecdKE39UpI4mc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "xxqKDCGNE4FS6e6YfAO73dlwKMeqaIbmrXNLc6utRYw=" -> "v1P1/g+mOvYauZhpkOrUfARDMNdR4X0sKeCDw1hG1j0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "8S2/G9/nCjy5xbLwvOe53gX74hfySHOuSnEJRQWfelI=" -> "hQj6+RMfL6jM90Twvw7jfjAVWPiKyGZKZnp+7qqgk20="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgLfBUXRiw6Z9snqc3rVgIAqVZbbLaiye7bvT3TVsf8=" -> "jYjzSzcjqM7QhimBfsoKqTV8itYXKuot+Tq+mzSkQ3c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "vdmF9SNMwepfX3WbpZHqfJIlKNncpi9/8aDVYZci8Ng=" -> "tNdlKolHxYPCMzjB3ZPXKvRmoSO2FvfLTVkBVmqzPa8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q7ovP7QW+FZNeUOXENZEc2hlah2LMXrREwkpniwy17E=" -> "2/8jZ10bd4bFCncK1d4ESshV1ETadsZqJK9XAqCeMts="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "/fj2hupGCYPggRAHam7fOlB8NhAgBHs3nYHb/rFThBg=" -> "4IKizm8j7WrWK+djBQ+hUR/o2/scqqI1OUHRbQ5fLSw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "YJEmcJtirN+DFDKmfCrdLluS2G7wADCNvC3sGtMF78Q=" -> "DhIV5qNQix6E2qCCgkPdIJOAcWuvNEqyxdvTQdts90w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "FR+4PNL1cdoahVEDbbKNYggPBPJVF+FuZ/vWiX1wXUs=" -> "+pqTo3u1EHzy00CQnMWI9Yf2r3fNjvdqFf47BD+EHEc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "AzcGwYTqYaYK7J1SH6IGQ3rD7FnxRsAAgcEuyRkvgI0=" -> "sCBVU5weDQL1xQYG+qakzdNkE2yQe4wP6M8LKqgT0JM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "yODY9zTLRxFH9/SZG/eed8IshboWD/pK0r/Nsj4rXCw=" -> "nXUsRRRM8Q/nVUfWW5rtdnfygW17JNYsEA3snOLk7NI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "UV8NuV5j9GE/yz2aMTwIwyWinCIBLCbRDjExUsNkx70=" -> "ZBOQ9R6Ye5EyD4GROJnS/8wWXlxYl9ft6R/Eg18d+dQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "y2N05WJwh2zaGyxb/8JJHubRAQvCmWpny5NrKT84T54=" -> "ch8mU7vyHSAe4SnfNe+cfVSnXwB+BOJGerdipNP/Hcw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "1Hde0chkVPzhGUTdW7OIfzM77rBB4ZAjab5i2xJZuVI=" -> "eHlrCw3Kt/WiWLMv4YSmUkJ4x4pV+WJAdcwiS57IJ9s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "znH14WJuN5LSCJ+kACI+6nr0ebcIeVF9IptEn4Fxs5c=" -> "rQcTm2KOIUS+P+YzNfiPzpUJRaZ14IQICXAICTGNYVU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "E3T7H9+zyHVlc7Qo9FVzRJfLB4t0wkMM9yKeiJlgoJE=" -> "NOVZbvLyIgJ9VAK+c+twyRu/pIleOdh/Uo3KT53zPQE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "G5NvU0N9zNfuHpRjsZcOlJME+ZKjQonL9aanGqlX8tE=" -> "OEUDnoSmisrGneUYI01NLkVJKpqw5+hCzV48Wj0Gvxg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-14T22:49:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhxjd6BAFCTXVZT6ChlOhyDCtLPuPcI1SIDewxFYdps=" -> "13wTclgAUvD7zuuujLQP7rlitT+01iyKDJuEV8rBGwc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "Prtn8+O/GqRk7XHgXMR/YXqMv+3brI9ZZ1VU1dAweaI=" -> "KC+c7V2OirY+KJEgKEfRjz1wnoNZJmM4s4nOg9xbbNs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "z3hTUThwvxGgCV674FEs+qKK+lbDiEjqF6rJgr1scXQ=" -> "hjXjfgx+DNZt4t1bf09tUftrjzImp91GY/GcnQZLggA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "6u5B3O1/muZLul8YsXeDFRcG+9ipyWXf6x58d9GGD/0=" -> "pGV8Nxzvx9EVuKs8raPePPB4glWQBCPQQjeAW8bRjA4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "SENwF1tJx2hGshJ8+RBm/Y9qTIifxQOh/xSVrWH3dw4=" -> "R2gY3nhSQXV8JamQsBW+WT9GfdtaQH/3KQp6sE4aVLE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "2hQc7B8chDahO1FO82rnJGdKGjJ1UIaZYlL7cSLRgLM=" -> "dF4RRATWlSXcf2YrjXFpt86X/GfnN7eLvc33N2+UNRg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZWSJlb3s50Dr+bwlc40cWaZ59aQzDyTIHBJlNbSwe/4=" -> "qA0/0vGEvYFKyvsBB7mitUntSkJECpJ5Yx0EjLss8aE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "DcCkhnt4oLE4F2M7KeFvd/jo6+78TTQZXiyBBdooSnY=" -> "FOMUzUCnGx8fWGj3tMvzutj/N9BhR1X/jBhk06XFqqg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "NW1heEXbJ1OI9sWpPbvW7fFz8U//l7MLJV3jE9rHmss=" -> "QRK8Hgns00VycAUiwQ02koVlzhMGtogFkUOOkZqEVeI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "k6YdB6//Bazrpepto6TekOmQlTjUhKA3V80xIdeOcgw=" -> "Y3MeVu/vACVine7IekuszmzIJaAAl9EZL888pczrptg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CJG4oaEP4lTzztQ2ee0P0AahjjSs4MGtN3HXwRiz+Mk=" -> "tdjaEYSOal8s/2hD9WNUF9w6cf7DjqtfiYAuWoqZIgQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "BodYvOnXHO8WponQvzii7V/awIKBf9a5eMkCl738HAw=" -> "QW3vCqzXTgSXmDBgJIbd6C2Iqps5ffJXV2puGlKxvtA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "8fFHsQFtkVE3YZMVThsDIku5ISKpKe0WIDaofALWs0I=" -> "EcK+XX5/pV3U5/8qLJ3PvyKFSlJ/dDNfocmxZm5Z4P4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9aNvE7Xap0zWywBDE2FhCFuAueKDN8z1/RFFO9D+ro=" -> "F0ai5WvDf0Xlk/9v1wbImC/JGlVlEzUFW6WAJ/KEjgI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "aotxLo1S+WGUpeI8AyvjmUIkV1ldjc6+Kh/fqWjSY8U=" -> "FkTsWBJeuRWZEM24VoxYpe6VImNvPgHEsv2h2WsHV4s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "dh4axu8yUAmyi+QOo5meAF2PXYYYlvQciCNNSWWX9OU=" -> "PIR/dZKq6VJpvETlSJ9mv14fcVWa5leAXUczetfnn70="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-13T05:03:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "nkvkm6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-13T05:03:44Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-13T05:03:42Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*